# macOS Bootstrap Brewfile
# Install with: brew bundle

brew "git"
brew "volta"
brew "antidote"
brew "dockutil"

cask "1password"
cask "1password-cli"
cask "cursor"
cask "slack"
cask "google-chrome"
cask "iina"
cask "spotify"
cask "finicky"
cask "clockify"
cask "mimestream"
cask "home-assistant"
cask "zen"

mas "Numbers", id: 409203825
mas "Pages", id: 409201541
mas "Super Agent", id: 1568262835
mas "1Password for Safari", id: 1569813296
mas "GCal for Google Calendar", id: 1107163858