# macOS Bootstrap Brewfile
# 
# This file defines all applications and tools to be installed via Homebrew.
# Install with: brew bundle
#
# Categories:
# - Development Tools: Essential development utilities
# - Security & Privacy: Password management and security tools
# - Productivity: Work and productivity applications
# - Communication: Messaging and collaboration tools
# - Media: Entertainment and media applications
# - Utilities: System utilities and tools
# - Mac App Store: Applications from the Mac App Store

# =============================================================================
# DEVELOPMENT TOOLS
# =============================================================================

# Version control system
brew "git"

# JavaScript tool manager (Node.js, npm, yarn, etc.)
brew "volta"

# Zsh plugin manager
brew "antidote"

# Dock customization utility
brew "dockutil"

# Oh My Posh - https://ohmyposh.dev/docs/installation/macos
brew "oh-my-posh"

# OpenAI Codex
brew "codex"

# opencode
brew "opencode"

# API development and testing platform
cask "postman"

# Meslo LG Nerd Font
cask "font-meslo-lg-nerd-font"

# =============================================================================
# SECURITY & PRIVACY
# =============================================================================

# Password manager
cask "1password"

# Command-line password manager
cask "1password-cli"

# =============================================================================
# PRODUCTIVITY
# =============================================================================

# AI-powered code editor
cask "cursor"

# AI assistant
cask "chatgpt"

# Time tracking application
cask "clockify"

# Email client
cask "mimestream"

# Smart home automation
cask "home-assistant"

# Terminal emulator
cask "ghostty"

# Docker
cask "docker-desktop"

# Google Drive
cask "google-drive"

# =============================================================================
# COMMUNICATION
# =============================================================================

# Team communication platform
cask "slack"

# WhatsApp client
cask "whatsapp"

# =============================================================================
# BROWSERS & WEB
# =============================================================================

# Web browser
cask "google-chrome"

# URL redirector for better browsing
cask "finicky"

# Privacy-focused browser
cask "zen"

# =============================================================================
# MEDIA & ENTERTAINMENT
# =============================================================================

# Video player
cask "iina"

# Music streaming
cask "spotify"

# =============================================================================
# MAC APP STORE APPLICATIONS
# =============================================================================

# Apple productivity suite
mas "Numbers", id: 409203825
mas "Pages", id: 409201541

# Browser automation tool
mas "Super Agent", id: 1568262835

# Safari extension for 1Password
mas "1Password for Safari", id: 1569813296

# Google Calendar integration
mas "GCal for Google Calendar", id: 1107163858
